{(А. Комков) Исполнитель Нолик преобразует двоичное число, записанное на экране.
У исполнителя есть две команды, которым присвоены номера:
1. Вычесть 1
2. Обнулить
Первая команда уменьшает число на 1. Вторая команда обнуляет все ненулевые
разряды, кроме старшего (например, для исходного числа 11101 результатом 
работы команды будет число 10000), если таких разрядов нет, то данная команда 
не выполняется.Сколько существует программ, которые исходное двоичное число 
1000000 преобразуют в двоичное число 1000?}
var
  t, c, i: integer;
  a: array[1..64] of integer;
  x: real;

begin
  a[64] := 1;
  for i := 64 downto 8 do
  begin
    t := i;c := 0;
    a[i - 1] += a[i];
    while t > 1 do
    begin
      c += 1;
      t := t div 2;
    end;
    x := t * 2 ** c;
    if x <> i then a[round(x)] += a[i];
  end;     
  writeln(a[8]);
end.